LLD for store app
